[
  {
    "text": "Indian immigrants in the US make up 1% of US's population.\nBut, pay 6% of the total taxes.\n\nIn UAE, Indian expats make up 38% of the total population.\nAnd, contribute heavily to UAE's economy.\n\nPeople who migrate: give up on their comfort zone, are usually hard working peace-loving folks, who build their life from scratch in a different country.\n\nThis requires guts.\n\nGoing forward: this trend is likely to accelerate.\n\nJapan's population is set to drop by 1Mn people each year (means: new opportunities)\nThailand's population is already shrinking (means: new opportunities)\n\nThese countries will welcome hard-working folks, as well.\nNot because they love you.\nBut, because they love what you can contribute to their economy.\n\nThe world has always been built on the backs of hard-working humans.\nAssess these opportunities.\nAnd, work towards them.",
    "engagement": 4356
  },
  {
    "text": "India posted 5.4% dismal growth rate recently.\n\nPeople are panicking that: if they put their money in the stock markets/investments, their wealth will erode.\n\nBut, will it? The short answer is NO.\n\nMost people misunderstand what wealth erosion looks like.\n\nWe assume that wealth erosion= you invest 10L, due to lack of growth it will go to 5L in a few years.\n\nBut, wealth erosion in 2025 looks very different--\n\n1) You invest 10Lakhs, after a few years it grows to 15L\n2) But the purchasing power of that money might just be worth 4L\n3) On top of all this, for all the capital gains, you will pay a high tax, so you end up with net purchasing power of maybe like 3L\n\nThat's modern day erosion of wealth.\n\nThis is dangerous\nBecause most people don't get it.\nAnd, therefore, can't do anything about it.",
    "engagement": 1516
  },
  {
    "text": "(1) Excessive government spending creates inflation.\n(2) More inflation creates more unrest (living crisis).\n(3) More unrest creates more freebies.\n(4) More freebies creates more government spending.\n(5) More government spending creates more inflation.\n\nSolution? improving productivity.\n\nStep 1 of improving productivity: reward merit.\nAnd, give them enough incentive (low taxes) to stay.\n\nNothing says: 'We want you to stay', like lower taxes :)",
    "engagement": 453
  },
  {
    "text": "Retiring early is boring.\n\nBut, getting financially free is exciting. Owning time, money and energy allows you to do things that you always dreamed off.\n\nHere are the steps that I went through--\n\n[1] Getting a good education. This opened up several opportunities for me.\n\n[2] Working abroad. This helped me save a lot of money.\nIf you have a good job abroad (and if you live frugally, you can save a lot).\n\nExample: 100,000 USD= 18-20 Lakh in INR (in Purchasing Power Parity terms) but is this really true?\n\nIt is much better to make 100K USD & save 20K (roughly 16.5L); than make 18 Lakhs in India.\n\n[3] Learning about the money system. The current money system will permanently keep you poor, if you let it.\n\nPeople think that PF, PPF, EPF is an 'investment'.\nWell it is not.\nIt is ticket to losing your hard earned money -- overtime.\n\nIf you refuse to see the problem with earning 8-9% returns on 10/15 year lock-ins, you need to educate yourself about finance.\n\n[4] Investing skills. Learning how to invest in stocks, real estate, businesses, bonds etc.\n\nEach of these asset classes have their own cycles. Being a stock/real estate maximalist doesn't help.\n\nInvest where opportunities are.\n\n[5] Being action oriented. Reading 100 books < implementing 1.\n\nVery rarely I would ever read a book completely.\nTry to read fast. And, with purpose.\n\n[6] Building small profitable businesses.\n\nDebt makes me uneasy. I realised fairly quickly: I want 0 investors, very less debt in life. So this ruled out building big businesses/funded businesses.\n\nMost of the businesses I have built are small profitable niche startups.\nThese are the type of startups I want to build.\n\nBusiness building is a very individual game. Some people like the glory of valuations, some people like to build profitable things.\n\n[7] Owning time.\n\nIf you have time to think, read, enjoy, creative ideas will flow.\nAfter a while, it all comes to controlling your time.\n\nYou don't need a course on productivity.\nYou need more clarity with your thoughts.\n\nIf you know what you what (truly), you will figure out a way to get it.\n\n[8] Being lucky.\n\nYou can work harder. And, increase the surface area of your luck.\nBut, you need luck to go your way.\n\nSo pray, if it helps.\n\nBe wise with what you can control.\nAnd, what you can't.\n\nWork hard. Be focused. Persist.",
    "engagement": 1954
  },
  {
    "text": "A man looked down from his 125Cr penthouse apartment's posh balcony-- but couldn't believe what he saw:\n\nHe saw a vegetable vendor sleeping next to his cart. All the potential buyers passing by.\n\n'This is lost business. Such blasphemy'\n\nHe took his private elevator. And, within 2 minutes, he was next to the poor vendor, trying to wake him up from his deep slumber (literally and figuratively!)\n\nRich guy: 'You ought to work hard!'\nVendor: But why?\n\nRich guy: So that you can make money.\nVendor: But why?\n\nRich guy: This will move the GDP\nVendor: What is GDP?\n\nRich guy: That's besides the point. Leave it.\n\nSee if you make money you will enjoy life.\nSee my apartment there? top floor?\n125Cr! You know how I got there?\n\nBy WORKING hard!\n\nVendor: But, what's the point of working hard?\n\nRich guy: You get to enjoy great things.\nLive peacefully. Rest.\nAnd, not worry about money.\n\nVendor: I am already enjoying my life. And, I was already resting-- till the point you woke me up to have this conversation.\n\n*******\nYou might have already read variants of this story.\nThe point is: to prioritise your present. And, not worry about the future.\n\nBut, the story presents only half the picture:-\n\nMost likely: you would have already made that 125Cr penthouse guy a villian.\nBut, here are the points we would often miss:\n\nLet's say we live only in the present:\n\n1) What if your family expands. Who takes care of their expenses?\n2) What if you have an emergency. Who takes care of that expense?\n3) What if your partner/you need to take a break from work for a few years. How will you manage your household?\n4) What if tax in India keeps increasing like Elon Musk's twitter followers, who pays for that?\n\nPoint is:\nGreed to constantly earn is bad.\nSimilarly, complacency can be a killer too.",
    "engagement": 2078
  },
  {
    "text": "[1] A young person, struggles with money.\n[2] A middle aged person, struggles with time.\n[3] An old person, struggles with energy.\n\nExcelling academically when you are kid, usually solves your money problems.\n\nPlanning ahead of time (financially!), probably gives you some free time when you are middle aged.\n\nWorking out when you are you are young/middle aged, usually keeps you fitter when you are old.\n\nYou don't need to constantly keep 'worrying' about the future.\nBut planning for better health, wealth and time -- will keep your life smooth(er).\n\nThis is probably the reason why: humans are the only specie that are capable of forward thinking.",
    "engagement": 3031
  },
  {
    "text": "In India, you can pay taxes for 20 years. But, if you lose your job at 50, you might come on road.\n\nAnd, will get no help.\n\nTherefore: 55% taxation in a Scandinavian country is better than 40% taxation in India (reason: in Scandinavia- healthcare, education, social security etc is there).\n\nNow this is not a bashing post or anything.\nThe real problem is: that there is no remedy in sight.\nAnd, that is what is infuriating.\n\nOur taxes realistically speaking-- can only go lower (and become sensible).\nIf, our labour productivity increases.\n\nAnd, for this to happen:\n- Corruption needs to be curbed.\n- Education needs to be improved.\n\nBut, if you look at our budgetary allocation of education: it now stands at a 6 year low.\n\nWith wrong priorities.\nRight taxation will not happen.",
    "engagement": 8189
  }
]